app/views/patients/show.html.erb

SELECT "requests".* FROM "requests" WHERE "requests"."patient_id" = ?  [["patient_id", 2]]
---
<h2>Requests</h2>
<% @patient.requests.each do |request| %>