app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" WHERE (name LIKE '%Jack%') ORDER BY created_at DESC
---
  def index
    @patients = Patient.all

INSERT INTO "patients" ("Name", "Date_of_Birth", "Address", "Phone_Number", "Infection", "Injury", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["Name", ""], ["Date_of_Birth", ""], ["Address", ""], ["Phone_Number", 0.0], ["Infection", ""], ["Injury", ""], ["created_at", 2017-03-11 12:22:47 UTC], ["updated_at", 2017-03-11 12:22:47 UTC]]
---
  def create
    @patient = Patient.new(patient_params)
      logger = MyLogger.send :new
      logger.logInformation("A new patient has been added - "+@patient.Name+" at "+Time.now.to_s)
    respond_to do |format|
      if @patient.save

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]
---
  def destroy
    @patient.destroy