app/controllers/requests_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
      @patient = Patient.find(params[:patient_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."patient_id" = ? AND "requests"."id" = ? LIMIT ?  [["patient_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def show
      @patient = Patient.find(params[:patient_id])
      @request = @patient.requests.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
      @patient = Patient.find(params[:patient_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "requests" ("details", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["details", "Conor needs further consultation from dr smith"], ["patient_id", 2], ["created_at", 2017-03-18 17:28:01 UTC], ["updated_at", 2017-03-18 17:28:01 UTC]]
---
    def create
        @patient = Patient.find(params[:patient_id])
        @request = @patient.requests.build(params.require(:request).permit(:details))
        if @request.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."patient_id" = ? AND "requests"."id" = ? LIMIT ?  [["patient_id", 2], ["id", 3], ["LIMIT", 1]]
---
  def edit
      @patient = Patient.find(params[:patient_id])
      @request = @patient.requests.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "requests" SET "details" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["details", "Conor needs further consultation from dr o connor"], ["updated_at", 2017-03-18 17:30:27 UTC], ["id", 3]]
---
    def update
        @patient = Patient.find(params[:patient_id])
        @request = Request.find(params[:id])
        if @request.update_attributes(params.require(:request).permit(:details))

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]
---
    def destroy
        @patient = Patient.find(params[:patient_id])
        @request = Request.find(params[:id])
        @request.destroy